<?php

use \App\Models\HistologicalList;
use Illuminate\Database\Seeder;

class HistologicalListsSeeder extends Seeder
{

    public function run()
    {
        $samples = [
            [
                "code" => 1,
                "name" => "Ադենոկարցինոմաներ"
            ],
            [
                "code" => 1,
                "name" => "Ալվեոլյար"
            ],
            [
                "code" => 1,
                "name" => "Գեղձային"
            ],
            [
                "code" => 1,
                "name" => "Պապիլյար"
            ],
            [
                "code" => 1,
                "name" => "(լուսավոր բջջային)"
            ],
            [
                "code" => 1,
                "name" => "Ինվազիվ ծորանային, բլթակային, մազաբջջային"
            ],
            [
                "code" => 2,
                "name" => "Բազալ բջջային քաղցկեղ"
            ],
            [
                "code" => 3,
                "name" => "Ադենոսարկոմա"
            ],
            [
                "code" => 3,
                "name" => "Վիլմսի ուռուցք"
            ],
            [
                "code" => 3,
                "name" => "լուսավոր բջջային քաղցկեղ"
            ],
            [
                "code" => 4,
                "name" => "Անգիոսարկոմա"
            ],
            [
                "code" => 4,
                "name" => "Անգիոէնդոթելիոմա"
            ],
            [
                "code" => 4,
                "name" => "Կապոշիի սարկոմա"
            ],
            [
                "code" => 5,
                "name" => "Լիպոսարկոմա"
            ],
            [
                "code" => 5,
                "name" => "Միքսոսարկոմա"
            ],
            [
                "code" => 5,
                "name" => "Ռաբդոմիսարկոմա"
            ],
            [
                "code" => 5,
                "name" => "Ֆիբրոսարկոմա"
            ],
            [
                "code" => 5,
                "name" => "Խոնդրոսարկոմա"
            ],
            [
                "code" => 5,
                "name" => "Մեզոթելիոմա"
            ],
            [
                "code" => 6,
                "name" => "Մելանոմա"
            ],
            [
                "code" => 6,
                "name" => "Նևուս մալիգնիզացված"
            ],
            [
                "code" => 7,
                "name" => "Օստեոբլաստոկլաստոմա"
            ],
            [
                "code" => 7,
                "name" => "Խոշոր բջջային չարորակ ուռուցք"
            ],
            [
                "code" => 8,
                "name" => "Ներծորանային, բլթակային ինվազիվ քաղցկեղ"
            ],
            [
                "code" => 8,
                "name" => "Պեդճետի հիվանդություն"
            ],
            [
                "code" => 9,
                "name" => "Ադենոկարցինոմա"
            ],
            [
                "code" => 9,
                "name" => "Մուցինոզ"
            ],
            [
                "code" => 9,
                "name" => "Սերոզ"
            ],
            [
                "code" => 9,
                "name" => "Սերոզ"
            ],
            [
                "code" => 9,
                "name" => "Ցիստադենոկարցինոմա"
            ],
            [
                "code" => 9,
                "name" => "Պսևդոմուցինոզ"
            ],
            [
                "code" => 9,
                "name" => "Ցիլիոէպիթելիալ, սկիռոզ"
            ],
            [
                "code" => 10,
                "name" => "Կարցինոմա (0-փուլ) ներէպիթելիալ քաղցկեղ"
            ],
            [
                "code" => 11,
                "name" => "Ալվեոլյար քաղցկեղ"
            ],
            [
                "code" => 11,
                "name" => "Կլոր բջջային քաղցկեղ"
            ],
            [
                "code" => 11,
                "name" => "Պոլիմորֆ բջջային քաղցկեղ"
            ],
            [
                "code" => 11,
                "name" => "Սոլիդ քաղցկեղ"
            ],
            [
                "code" => 11,
                "name" => "Չդիֆերենցված քաղցկեղ"
            ],
            [
                "code" => 11,
                "name" => "Իլիկաձև բջջային քաղցկեղ"
            ],
            [
                "code" => 12,
                "name" => "Տափակ բջջային քաղցկեղ"
            ],
            [
                "code" => 12,
                "name" => "ա/եղճերացող"
            ],
            [
                "code" => 12,
                "name" => "բ/չեղճերացող"
            ],
            [
                "code" => 13,
                "name" => "Անցումա-բջջային քաղցկեղ"
            ],
            [
                "code" => 14,
                "name" => "Ռետինոբլաստոմա"
            ],
            [
                "code" => 15,
                "name" => "Սարկոմաներ"
            ],
            [
                "code" => 15,
                "name" => "Օստեոսարկոմաներ"
            ],
            [
                "code" => 15,
                "name" => "ա/օստեոբլաստիկ"
            ],
            [
                "code" => 15,
                "name" => "բ/օստեոբլաստիկ"
            ],
            [
                "code" => 16,
                "name" => "Սեմինոմա, էմբրիոնալ քաղցկեղ սպերմատոցիտոմա, տերատոբլաստոմա"
            ],
            [
                "code" => 17,
                "name" => "Լիմֆոգրանուլեմատոզ (իր կառուցվածքային տարատեսակներով)"
            ],
            [
                "code" => 18,
                "name" => "Լիմֆոմաներ – չարոչակ (իր կառուցվածքային տարատեսակներով)"
            ],
            [
                "code" => 19,
                "name" => "Միելումային հիվանդություն, լիմֆոպրոլիֆերատիվ համախտանիշներ"
            ],
            [
                "code" => 20,
                "name" => "Լեյկոզներ"
            ],
            [
                "code" => 20,
                "name" => "ա/լիմֆոլեյկոզներ"
            ],
            [
                "code" => 20,
                "name" => "բ/լիմֆոլեյկոզներ"
            ],
            [
                "code" => 20,
                "name" => "գ/լիմֆոլեյկոզներ"
            ],
            [
                "code" => 20,
                "name" => "դ/լիմֆոլեյկոզներ"
            ],
            [
                "code" => 20,
                "name" => "ե/լիմֆոլեյկոզներ"
            ],
            [
                "code" => 20,
                "name" => "զ/լիմֆոլեյկոզներ"
            ],
            [
                "code" => 21,
                "name" => "Նեյրոբլաստոմաներ՝"
            ],
            [
                "code" => 21,
                "name" => "Մեդուլոբլաստոմա՝"
            ],
            [
                "code" => 21,
                "name" => "Աստրոցիտոմա չարորակ գլիոմա-չարորակ մենինդրամաներ"
            ],
            [
                "code" => 22,
                "name" => "Աստրոցիտոմա չարորակ գլիոմա-չարորակ մենինդրամաներ"
            ]

        ];
        foreach ($samples as $samplesOther) {
            HistologicalList::create([
                "name" => $samplesOther['name'],
                "code" => $samplesOther['code']
            ]);
        }
    }
}
