<?php


use Illuminate\Database\Seeder;
use  \App\Models\Scholarships_list;
class ScholarshipsListsSeeder extends Seeder
{

    public function run()
    {
        $samples = [
            ["name" => "2.4 Գինեկոլոգիական" ],
            ["name" => "2.7 Վերակենդանացման" ],
            ["name" => "2.44 Շուրջօրյա հիվանդանոցային բուժօգնություն չպահանջող փոքր վիրաբուժական միջամտություններ" ],
            ["name" => "3.1 Ուռուցքաբանական" ],
            ["name" => "3.1.1 Ուռուցքաբանական (ԶԾ, լիցենզիայի առկայության դեպքում)" ],
            ["name" => "3.4 Թոքաբանական" ],
            ["name" => "3.18 Քիթ-կոկորդ-ականջաբանական" ],
            ["name" => "3.20 Կրծքային վիրաբուժական" ],
            ["name" => "3.23 Որովայնային վիրաբուժական" ],
            ["name" => "3.24 Ուրոլոգիական" ],
            ["name" => "3.25 Պրոկտոլոգիական" ],
            ["name" => "3.26 Վնասվածքաբանական" ],
            ["name" => "3.27 Օրթոպեդիական" ],
            ["name" => "3.59 Պալիատիվ" ],
            ["name" => "6. ՀՀ կառավարության 2008թ. մարտի 27-ի N 276-Ն որոշմամբ հաստատված բժշկական օգնության և սպասարկման տեսակներից բխող` բժշկական օգնության կազմակերպման
            ձևով պայմանավորված պետական պատվերի տեղադրման գործընթացում կիրառվող ծառայություններ" ],
            ["name" => "7. Մի քանի խմբերում կրկնվող ծառայություններ" ],
            ["name" => "9. Բոնուս, ՀՀ ԱՆ հրամանով կատարվող բուժօգնություն" ],

        ];
        foreach ($samples as $samplesOther) {
            Scholarships_list::create([
                "name" => $samplesOther['name'],

            ]);
        }
    }
}
